import pytest
@pytest.fixture(params={
    ("1234567890123456", "1234 56** **** 3456"),
    (1234567890123456, "1234 56** **** 3456"),
    ("0000111122223333", "0000 11** **** 3333"),
    ("123456789012", "1234 56** **** 9012"),
    ("123", "123 ** **** "),
    ("", " ** **** "),
})
def card_test_data(request):
    return request.param

# Фикстура для номеров счетов
@pytest.fixture(params=[
    ("12345678901234567890", "**7890"),
    (12345678901234567890,   "**7890"),
    ("1234",                 "**1234"),
    ("12",                   "**12"),
    ("",                     "**"),
    ("abc",                  "**abc"),
])
def account_test_data(request):
    return request.param

